index.org
#+TITLE: James Pascaleff

Associate Professor\\
[[http://math.illinois.edu/][Department of Mathematics]]\\
[[http://illinois.edu/][University of Illinois]]

| ⌘ | 357 [[http://ada.fs.illinois.edu/0026.html][Altgeld Hall]]      |
| ☏ | +1 217 244 7277       |
| ✉ | [[mailto:jpascale@illinois.edu][jpascale@illinois.edu]] |

I am a mathematician working on symplectic topology and mirror symmetry.

You can see my [[file:cv.html][full CV here]].

* Courses

- Fall 2022:
  - Math 518, Differentiable Manifolds I. MWF 9:00 am in 141 Altgeld Hall.
  - Math 595, Fukaya categories of surfaces. MWF 11:00 am in 441 Altgeld Hall.
- October 2020: Minicourse "Introduction to Fukaya Categories" at the [[https://www.him.uni-bonn.de/programs/past-programs/past-junior-trimester-programs/new-trends-in-representation-theory/new-trends-in-representation-theory-school/][Hausdorff Institute]]
  - Lecture 1: [[https://faculty.math.illinois.edu/~jpascale/lecture1.pdf][slides]], [[https://www.youtube.com/watch?v=3El9B9RU5qk][video]].
  - Lecture 2: [[https://faculty.math.illinois.edu/~jpascale/lecture2.pdf][slides]], [[https://www.youtube.com/watch?v=A6-4brPnDIg][video]].
  - Lecture 3: [[https://faculty.math.illinois.edu/~jpascale/lecture3.pdf][slides]], [[https://www.youtube.com/watch?v=zZuFv6QHAhY][video]].
- Summer 2019: Young Scholars Program (University of Chicago)
  - [[http://faculty.math.illinois.edu/~jpascale/courses/2019/ysp/knots-lectures.pdf][Lecture notes]].
  - [[http://faculty.math.illinois.edu/~jpascale/courses/2019/ysp/boltzmann-weights.pdf][Boltzmann weights for the Jones polynomial as a Potts model]].
- [[file:courses.html][All previous courses and seminars]]

** Past graduate topics courses

- Spring 2018: [[https://faculty.math.illinois.edu/~jpascale/courses/2018/595/][Homological Mirror Symmetry]]
- Spring 2014: [[https://faculty.math.illinois.edu/~jpascale/courses/2014/m392c/][Lagrangian Floer Homology]]

* Research

- My [[http://www.arxiv.org/a/Pascaleff_J_1][arXiv]] and [[http://scholar.google.com/citations?user=O_rkweQAAAAJ][google scholar]] pages.

** Research articles
   - [[https://faculty.math.illinois.edu/~jpascale/papers/dsing-divisors.pdf][Singularity categories of normal crossings surfaces, descent, and mirror symmetry]],\\
     with Nicolò Sibilla, [[https://arxiv.org/abs/2208.03896][arXiv:2208.03896]].

   - [[https://faculty.math.illinois.edu/~jpascale/papers/pants.pdf][Fukaya categories of higher-genus surfaces and pants decompositions]],\\
     with Nicolò Sibilla, [[https://arxiv.org/abs/2103.03366][arXiv:2103.03366]].

   - [[https://faculty.math.illinois.edu/~jpascale/papers/monoidal.pdf][Poisson geometry, monoidal Fukaya categories, and commutative Floer cohomology rings]],\\
     [[https://arxiv.org/abs/1803.07676][arXiv:1803.07676]], submitted.

   - [[https://faculty.math.illinois.edu/~jpascale/papers/wall-crossing-mutations.pdf][The wall-crossing formula and Lagrangian mutations]],\\
     with [[https://math.berkeley.edu/~tonkonog][Dmitry Tonkonog]], /Adv. Math./ Volume 361, 12 February 2020, 106850. ([[https://arxiv.org/abs/1711.03209][arXiv:1711.03209]])

   - [[https://faculty.math.illinois.edu/~jpascale/papers/top-fuk-surfaces.pdf][Topological Fukaya category and mirror symmetry for punctured surfaces]],\\
     with [[https://www.kent.ac.uk/smsas/personal/ns597/][Nicolò Sibilla]], /Compositio Math./ Volume 155, Issue 3 (2019), pp. 599--644. ([[https://arxiv.org/abs/1604.06448][arXiv:1604.06448]])

   - [[https://faculty.math.illinois.edu/~jpascale/papers/sl2equiv.pdf][Floer cohomology of g-equivariant Lagrangian branes]],\\
     with [[http://www.mth.kcl.ac.uk/~lekili/][Yankı Lekili]], /Compositio Math./ Volume 152, Issue 05 (2016), pp. 1071--1110. ([[http://arxiv.org/abs/1310.8609][arXiv:1310.8609]])

   - [[https://faculty.math.illinois.edu/~jpascale/papers/log-cy.pdf][On the symplectic cohomology of log Calabi--Yau surfaces]],\\
     /Geom. Topol./ Volume 23, Issue 6 (2019), pp. 2701--2792. ([[http://arxiv.org/abs/1304.5298][arXiv:1304.5298]])

   - [[https://faculty.math.illinois.edu/~jpascale/papers/cp2-conic-line.pdf][Floer cohomology in the mirror of the projective plane and a binodal cubic curve]],\\
     /Duke Math. J./ Volume 163, Number 13 (2014), pp. 2427--2516. ([[http://arxiv.org/abs/1109.3255][arXiv:1109.3255]], or [[https://faculty.math.illinois.edu/~jpascale/papers/pascaleff-thesis.pdf][thesis]] version)

** Expository notes
           
   - [[https://faculty.math.illinois.edu/~jpascale/courses/2017/bcov/perturbative.pdf][Perturbative quantization and master equation (after Costello)]], Spring 2017.

* Mini-CV

- 2020--Present: Associate Professor, University of Illinois at Urbana-Champaign.
- 2014--2020: Assistant Professor, University of Illinois at Urbana-Champaign.
- 2011--2014: Postdoctoral Fellow, Geometry and Topology RTG, University of Texas at Austin.
- 2006--2011: Graduate Student, MIT (PhD 2011, advisor: [[http://www.math.harvard.edu/~auroux/][Denis Auroux]]).
- 2002--2006: Undergraduate, University of Chicago (AB 2006).

