index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-03-27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>James Pascaleff</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" title="Standard" href="css/worg.css" type="text/css">
<link rel="alternate stylesheet" title="Zenburn" href="css/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="css/worg-classic.css" type="text/css" />
<link rel="shortcut icon" href="https://math.illinois.edu/themes/custom/las_unit_theme/favicon-32x32.png" type="image/png" />
</head>
<body>
<main id="content">
<header>
<h1 class="title">James Pascaleff</h1>
</header><p>
Associate Professor<br>
<a href="http://math.illinois.edu/">Department of Mathematics</a><br>
<a href="http://illinois.edu/">University of Illinois</a>
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">⌘</td>
<td class="org-left">357 <a href="http://ada.fs.illinois.edu/0026.html">Altgeld Hall</a></td>
</tr>

<tr>
<td class="org-left">☏</td>
<td class="org-left">+1 217 244 7277</td>
</tr>

<tr>
<td class="org-left">✉</td>
<td class="org-left"><a href="mailto:jpascale@illinois.edu">jpascale@illinois.edu</a></td>
</tr>
</tbody>
</table>

<p>
I am a mathematician working on symplectic topology and mirror symmetry.
</p>

<p>
You can see my <a href="cv.html">full CV here</a>.
</p>

<section id="outline-container-org2395109" class="outline-2">
<h2 id="org2395109">Courses</h2>
<div class="outline-text-2" id="text-org2395109">
<ul class="org-ul">
<li>Fall 2022:
<ul class="org-ul">
<li><a href="https://pascaleff.github.io/518fa22/">Math 518, Differentiable Manifolds I</a>. MWF 9:00 am in 141 Altgeld Hall.</li>
<li><a href="https://pascaleff.github.io/595fa22/">Math 595, Fukaya categories of surfaces</a>. MWF 11:00 am in 441 Altgeld Hall.</li>
</ul></li>
<li>October 2020: Minicourse &ldquo;Introduction to Fukaya Categories&rdquo; at the <a href="https://www.him.uni-bonn.de/programs/past-programs/past-junior-trimester-programs/new-trends-in-representation-theory/new-trends-in-representation-theory-school/">Hausdorff Institute</a>
<ul class="org-ul">
<li>Lecture 1: <a href="https://faculty.math.illinois.edu/~jpascale/lecture1.pdf">slides</a>, <a href="https://www.youtube.com/watch?v=3El9B9RU5qk">video</a>.</li>
<li>Lecture 2: <a href="https://faculty.math.illinois.edu/~jpascale/lecture2.pdf">slides</a>, <a href="https://www.youtube.com/watch?v=A6-4brPnDIg">video</a>.</li>
<li>Lecture 3: <a href="https://faculty.math.illinois.edu/~jpascale/lecture3.pdf">slides</a>, <a href="https://www.youtube.com/watch?v=zZuFv6QHAhY">video</a>.</li>
</ul></li>
<li>Summer 2019: Young Scholars Program (University of Chicago)
<ul class="org-ul">
<li><a href="http://faculty.math.illinois.edu/~jpascale/courses/2019/ysp/knots-lectures.pdf">Lecture notes</a>.</li>
<li><a href="http://faculty.math.illinois.edu/~jpascale/courses/2019/ysp/boltzmann-weights.pdf">Boltzmann weights for the Jones polynomial as a Potts model</a>.</li>
</ul></li>
<li><a href="courses.html">All previous courses and seminars</a></li>
</ul>
</div>

<div id="outline-container-org427c2b9" class="outline-3">
<h3 id="org427c2b9">Past graduate topics courses</h3>
<div class="outline-text-3" id="text-org427c2b9">
<ul class="org-ul">
<li>Spring 2018: <a href="https://faculty.math.illinois.edu/~jpascale/courses/2018/595/">Homological Mirror Symmetry</a></li>
<li>Spring 2014: <a href="https://faculty.math.illinois.edu/~jpascale/courses/2014/m392c/">Lagrangian Floer Homology</a></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org3e06fc8" class="outline-2">
<h2 id="org3e06fc8">Research</h2>
<div class="outline-text-2" id="text-org3e06fc8">
<ul class="org-ul">
<li>My <a href="http://www.arxiv.org/a/Pascaleff_J_1">arXiv</a> and <a href="http://scholar.google.com/citations?user=O_rkweQAAAAJ">google scholar</a> pages.</li>
</ul>
</div>

<div id="outline-container-org2921967" class="outline-3">
<h3 id="org2921967">Research articles</h3>
<div class="outline-text-3" id="text-org2921967">
<ul class="org-ul">
<li><a href="https://jpascale.web.illinois.edu/papers/dg-versus-a-infinity.pdf">Remarks on the equivalence between differential graded categories and A-infinity categories</a>,<br>
<a href="https://arxiv.org/abs/2211.05861">arXiv:2211.05861</a>.</li>

<li><a href="https://jpascale.web.illinois.edu/papers/dsing-divisors.pdf">Singularity categories of normal crossings surfaces, descent, and mirror symmetry</a>,<br>
with Nicolò Sibilla, <a href="https://arxiv.org/abs/2208.03896">arXiv:2208.03896</a>.</li>

<li><a href="https://jpascale.web.illinois.edu/papers/pants.pdf">Fukaya categories of higher-genus surfaces and pants decompositions</a>,<br>
with Nicolò Sibilla, <a href="https://arxiv.org/abs/2103.03366">arXiv:2103.03366</a>.</li>

<li><a href="https://jpascale.web.illinois.edu/papers/monoidal.pdf">Poisson geometry, monoidal Fukaya categories, and commutative Floer cohomology rings</a>,<br>
<a href="https://arxiv.org/abs/1803.07676">arXiv:1803.07676</a>, submitted.</li>

<li><a href="https://jpascale.web.illinois.edu/papers/wall-crossing-mutations.pdf">The wall-crossing formula and Lagrangian mutations</a>,<br>
with Dmitry Tonkonog, <i>Adv. Math.</i> Volume 361, 12 February 2020, 106850. (<a href="https://arxiv.org/abs/1711.03209">arXiv:1711.03209</a>)</li>

<li><a href="https://jpascale.web.illinois.edu/papers/top-fuk-surfaces.pdf">Topological Fukaya category and mirror symmetry for punctured surfaces</a>,<br>
with Nicolò Sibilla, <i>Compositio Math.</i> Volume 155, Issue 3 (2019), pp. 599&#x2013;644. (<a href="https://arxiv.org/abs/1604.06448">arXiv:1604.06448</a>)</li>

<li><a href="https://jpascale.web.illinois.edu/papers/sl2equiv.pdf">Floer cohomology of g-equivariant Lagrangian branes</a>,<br>
with Yankı Lekili, <i>Compositio Math.</i> Volume 152, Issue 05 (2016), pp. 1071&#x2013;1110. (<a href="http://arxiv.org/abs/1310.8609">arXiv:1310.8609</a>)</li>

<li><a href="https://jpascale.web.illinois.edu/papers/log-cy.pdf">On the symplectic cohomology of log Calabi&#x2013;Yau surfaces</a>,<br>
<i>Geom. Topol.</i> Volume 23, Issue 6 (2019), pp. 2701&#x2013;2792. (<a href="http://arxiv.org/abs/1304.5298">arXiv:1304.5298</a>)</li>

<li><a href="https://jpascale.web.illinois.edu/papers/cp2-conic-line.pdf">Floer cohomology in the mirror of the projective plane and a binodal cubic curve</a>,<br>
<i>Duke Math. J.</i> Volume 163, Number 13 (2014), pp. 2427&#x2013;2516. (<a href="http://arxiv.org/abs/1109.3255">arXiv:1109.3255</a>, or <a href="https://jpascale.web.illinois.edu/papers/pascaleff-thesis.pdf">thesis</a> version)</li>
</ul>
</div>
</div>

<div id="outline-container-org476b6df" class="outline-3">
<h3 id="org476b6df">Expository notes</h3>
<div class="outline-text-3" id="text-org476b6df">
<ul class="org-ul">
<li><a href="https://faculty.math.illinois.edu/~jpascale/courses/2017/bcov/perturbative.pdf">Perturbative quantization and master equation (after Costello)</a>, Spring 2017.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org8ee04f1" class="outline-2">
<h2 id="org8ee04f1">Mini-CV</h2>
<div class="outline-text-2" id="text-org8ee04f1">
<ul class="org-ul">
<li>2020&#x2013;Present: Associate Professor, University of Illinois at Urbana-Champaign.</li>
<li>2014&#x2013;2020: Assistant Professor, University of Illinois at Urbana-Champaign.</li>
<li>2011&#x2013;2014: Postdoctoral Fellow, Geometry and Topology RTG, University of Texas at Austin.</li>
<li>2006&#x2013;2011: Graduate Student, MIT (PhD 2011, advisor: <a href="http://www.math.harvard.edu/~auroux/">Denis Auroux</a>).</li>
<li>2002&#x2013;2006: Undergraduate, University of Chicago (AB 2006).</li>
</ul>
</div>
</section>
</main>
<footer id="postamble" class="status">
This website was made with <a href="http://www.gnu.org/software/emacs/">Emacs</a> <a href="http://orgmode.org">Org-mode</a>. The css stylesheets are taken from <a href="http://orgmode.org/worg">orgmode.org/worg</a> and are licensed under the <a href="http://www.gnu.org/licenses/gpl.html">GNU General Public License v3</a> or later.
</footer>
</body>
</html>
